experiments/socialnetwork_singlenode/expected_results/write_qps1800/wrk.log
Running 2m test @ http://ip-172-31-8-50.us-east-2.compute.internal:8080
  4 threads and 48 connections
  Thread calibration: mean lat.: 5.754ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.747ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.743ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 5.720ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.95ms    1.08ms  41.38ms   79.13%
    Req/Sec   467.84     75.08   833.00     68.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.83ms
 75.000%    6.46ms
 90.000%    7.10ms
 99.000%    8.68ms
 99.900%   15.25ms
 99.990%   30.77ms
 99.999%   33.76ms
100.000%   41.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.539     0.000000            1         1.00
       4.887     0.100000        25408         1.11
       5.175     0.200000        50666         1.25
       5.403     0.300000        75627         1.43
       5.615     0.400000       101264         1.67
       5.827     0.500000       126193         2.00
       5.935     0.550000       138597         2.22
       6.051     0.600000       151317         2.50
       6.175     0.650000       163943         2.86
       6.307     0.700000       176418         3.33
       6.459     0.750000       189239         4.00
       6.539     0.775000       195270         4.44
       6.627     0.800000       201605         5.00
       6.723     0.825000       207831         5.71
       6.831     0.850000       214239         6.67
       6.951     0.875000       220409         8.00
       7.023     0.887500       223691         8.89
       7.099     0.900000       226854        10.00
       7.179     0.912500       229885        11.43
       7.275     0.925000       233026        13.33
       7.391     0.937500       236239        16.00
       7.455     0.943750       237769        17.78
       7.527     0.950000       239382        20.00
       7.603     0.956250       240908        22.86
       7.695     0.962500       242492        26.67
       7.803     0.968750       244036        32.00
       7.867     0.971875       244815        35.56
       7.943     0.975000       245619        40.00
       8.031     0.978125       246418        45.71
       8.135     0.981250       247174        53.33
       8.279     0.984375       247972        64.00
       8.359     0.985938       248354        71.11
       8.455     0.987500       248745        80.00
       8.583     0.989062       249150        91.43
       8.743     0.990625       249539       106.67
       8.943     0.992188       249924       128.00
       9.087     0.992969       250120       142.22
       9.279     0.993750       250325       160.00
       9.527     0.994531       250523       182.86
       9.823     0.995313       250717       213.33
      10.247     0.996094       250909       256.00
      10.487     0.996484       251006       284.44
      10.759     0.996875       251104       320.00
      11.127     0.997266       251203       365.71
      11.687     0.997656       251301       426.67
      12.279     0.998047       251400       512.00
      12.671     0.998242       251449       568.89
      13.215     0.998437       251498       640.00
      13.855     0.998633       251547       731.43
      14.583     0.998828       251597       853.33
      15.375     0.999023       251646      1024.00
      15.855     0.999121       251670      1137.78
      16.575     0.999219       251695      1280.00
      17.343     0.999316       251719      1462.86
      18.111     0.999414       251744      1706.67
      19.567     0.999512       251769      2048.00
      21.135     0.999561       251781      2275.56
      23.135     0.999609       251793      2560.00
      24.335     0.999658       251805      2925.71
      25.983     0.999707       251818      3413.33
      27.423     0.999756       251830      4096.00
      27.695     0.999780       251836      4551.11
      28.463     0.999805       251842      5120.00
      29.167     0.999829       251848      5851.43
      29.487     0.999854       251855      6826.67
      30.223     0.999878       251861      8192.00
      30.607     0.999890       251864      9102.22
      30.927     0.999902       251867     10240.00
      31.327     0.999915       251870     11702.86
      31.439     0.999927       251873     13653.33
      31.615     0.999939       251877     16384.00
      31.983     0.999945       251878     18204.44
      32.031     0.999951       251879     20480.00
      32.351     0.999957       251881     23405.71
      32.607     0.999963       251882     27306.67
      32.735     0.999969       251884     32768.00
      32.927     0.999973       251885     36408.89
      32.927     0.999976       251885     40960.00
      33.503     0.999979       251886     46811.43
      33.599     0.999982       251887     54613.33
      33.759     0.999985       251888     65536.00
      33.759     0.999986       251888     72817.78
      33.759     0.999988       251888     81920.00
      34.079     0.999989       251889     93622.86
      34.079     0.999991       251889    109226.67
      34.335     0.999992       251890    131072.00
      34.335     0.999993       251890    145635.56
      34.335     0.999994       251890    163840.00
      34.335     0.999995       251890    187245.71
      34.335     0.999995       251890    218453.33
      41.407     0.999996       251891    262144.00
      41.407     1.000000       251891          inf
#[Mean    =        5.951, StdDeviation   =        1.075]
#[Max     =       41.376, Total count    =       251891]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    4.95ms
 75.000%    5.55ms
 90.000%    6.14ms
 99.000%    7.61ms
 99.900%   14.35ms
 99.990%   30.01ms
 99.999%   32.65ms
100.000%   40.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.325     0.000000            1         1.00
       4.223     0.100000        25446         1.11
       4.435     0.200000        50617         1.25
       4.607     0.300000        76094         1.43
       4.771     0.400000       101017         1.67
       4.951     0.500000       126233         2.00
       5.047     0.550000       138584         2.22
       5.151     0.600000       151159         2.50
       5.271     0.650000       164080         2.86
       5.403     0.700000       176659         3.33
       5.547     0.750000       189163         4.00
       5.627     0.775000       195509         4.44
       5.711     0.800000       201756         5.00
       5.799     0.825000       207823         5.71
       5.899     0.850000       214161         6.67
       6.011     0.875000       220498         8.00
       6.071     0.887500       223564         8.89
       6.139     0.900000       226756        10.00
       6.215     0.912500       229900        11.43
       6.299     0.925000       233056        13.33
       6.395     0.937500       236203        16.00
       6.451     0.943750       237779        17.78
       6.515     0.950000       239376        20.00
       6.583     0.956250       240888        22.86
       6.667     0.962500       242505        26.67
       6.763     0.968750       244042        32.00
       6.823     0.971875       244830        35.56
       6.891     0.975000       245621        40.00
       6.975     0.978125       246410        45.71
       7.075     0.981250       247191        53.33
       7.203     0.984375       247959        64.00
       7.291     0.985938       248356        71.11
       7.383     0.987500       248751        80.00
       7.511     0.989062       249145        91.43
       7.691     0.990625       249539       106.67
       7.943     0.992188       249924       128.00
       8.115     0.992969       250120       142.22
       8.343     0.993750       250317       160.00
       8.599     0.994531       250519       182.86
       8.903     0.995313       250713       213.33
       9.343     0.996094       250909       256.00
       9.631     0.996484       251008       284.44
       9.935     0.996875       251106       320.00
      10.351     0.997266       251206       365.71
      10.775     0.997656       251301       426.67
      11.343     0.998047       251400       512.00
      11.679     0.998242       251449       568.89
      12.311     0.998437       251498       640.00
      12.823     0.998633       251547       731.43
      13.607     0.998828       251597       853.33
      14.463     0.999023       251646      1024.00
      14.959     0.999121       251670      1137.78
      15.535     0.999219       251695      1280.00
      16.415     0.999316       251720      1462.86
      17.471     0.999414       251745      1706.67
      18.271     0.999512       251769      2048.00
      18.575     0.999561       251781      2275.56
      19.263     0.999609       251793      2560.00
      20.031     0.999658       251805      2925.71
      21.631     0.999707       251818      3413.33
      26.207     0.999756       251830      4096.00
      26.831     0.999780       251836      4551.11
      27.615     0.999805       251842      5120.00
      28.223     0.999829       251849      5851.43
      28.847     0.999854       251855      6826.67
      29.215     0.999878       251861      8192.00
      29.759     0.999890       251864      9102.22
      30.015     0.999902       251867     10240.00
      30.207     0.999915       251870     11702.86
      30.591     0.999927       251873     13653.33
      30.783     0.999939       251876     16384.00
      31.215     0.999945       251878     18204.44
      31.279     0.999951       251879     20480.00
      31.359     0.999957       251881     23405.71
      31.455     0.999963       251882     27306.67
      32.015     0.999969       251884     32768.00
      32.287     0.999973       251885     36408.89
      32.287     0.999976       251885     40960.00
      32.303     0.999979       251887     46811.43
      32.303     0.999982       251887     54613.33
      32.655     0.999985       251888     65536.00
      32.655     0.999986       251888     72817.78
      32.655     0.999988       251888     81920.00
      32.831     0.999989       251889     93622.86
      32.831     0.999991       251889    109226.67
      33.087     0.999992       251890    131072.00
      33.087     0.999993       251890    145635.56
      33.087     0.999994       251890    163840.00
      33.087     0.999995       251890    187245.71
      33.087     0.999995       251890    218453.33
      40.319     0.999996       251891    262144.00
      40.319     1.000000       251891          inf
#[Mean    =        5.113, StdDeviation   =        0.979]
#[Max     =       40.288, Total count    =       251891]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  269966 requests in 2.50m, 55.35MB read
Requests/sec:   1799.76
Transfer/sec:    377.88KB